#05985*$SET INTLEVEL"4"
#05985*$SET  CICSECM(LINKAGE=NO)
       IDENTIFICATION DIVISION.
       PROGRAM-ID. JLSL999X.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  METHOD-NAME                 PIC X(32).
       01  JLSL999X-FILTER-DATA.
           03  FILT999-TRAN-CATEGORY   PIC N(20).
               88  FILT999-TRAN-CATEGORY-ALL     VALUE SPACES.  
       LINKAGE SECTION.
       01  JLSL999X-DATA                    PIC X VALUE SPACE.
       PROCEDURE DIVISION.
       MAIN SECTION.
           PERFORM INITIALIZATION.
           DISPLAY 'ENTER PROGRAM'.   
               DISPLAY 'INSIDE PROGRAM - '.
               SET  FILT999-TRAN-CATEGORY-ALL
                                       TO TRUE.
               DISPLAY 'SET FILT999-TRAN-CATEGORY: '
               FUNCTION DISPLAY-OF(FILT999-TRAN-CATEGORY).
               MOVE SPACES TO FILT999-TRAN-CATEGORY. 
               DISPLAY 'MOVE FILT999-TRAN-CATEGORY: '
               FUNCTION DISPLAY-OF(FILT999-TRAN-CATEGORY).
               SET  FILT999-TRAN-CATEGORY-ALL
                                       TO TRUE.
               DISPLAY 'SET2 FILT999-TRAN-CATEGORY: '
               FUNCTION DISPLAY-OF(FILT999-TRAN-CATEGORY).
               GOBACK.    
       INITIALIZATION SECTION.
           INITIALIZE JLSL999X-FILTER-DATA.